{
  "exam code": "CS0-003",
  "certification": "CSA+",
  "Lesson_number": 1,
  "Lesson_name": "Understanfing Vulnerability Reponse, Handling, and Management",
  "Topic": "Understanding Cybersecurity Leadership Concepts",
  "SubTopic": "Exploring Threat Actor Concepts",
  "Cyber security leader": "Responsible for the vison and setting the goals that the team uses to secure an organization's assets. Understand technical and legal to give the best advise for approaching different types of appropriate levels of protection. They should have the ability to make fast decisions based on industry standards and changes, with strong clear communitcation to everyone.",
  "Governace": "To avoid emotion driven quick fix; Proper planning and management is needed and established for the best success. <BLANK>, rick and ,cmopliance teams create and maintain organizational polices.",
  "Policy and procedures": "Referred to a roadmap meaning the tools that give guidance and clear direction. These well crafted policies and procedures that define response action. Established, incident-handling practices that give a thing to do and remove the need to think in high pressure moments. It gives employees a guild for them to have consistent and reliable steps to take for high performance.",
"MMTD":"Mean time to detect", 
  "MTTR": "Mean Time to recover",
  "ToP": "Time to Patch",
"Security Operation Center":"Location where security professional monitor and protect critical information assets in an organization.",
"Cyber service-level Objective":"Standards that organization and their leadership must meet to ensure the security of their network.",
"Risk Avoid":"practice of ceasing activity that presents risk.",
"Risk Acceptance": "The response of determining that a risk is within the organization's appetite and no countermeasures other than ongoing monitoring is needed.",
"Risk mitigation":" The response of reducing  risk to fit within an organizations willingness to accept risk.",
"Risk Transference":" Moving  or sharing the responsibility of risk to another entity, such as by purchasing  cybersecurity insurance.",
"Threat Modeling":"The process of identifying and assessing the possible threat actors and attack vectors that pose a risk to the security of an app, network, or other system.The process of identifying and assessing the possible threat actors and attack vectors that pose a risk to the security of an app, network, or other system.",
 "Compliance":"What is the name of the team that risk managers depend upon to assess whether work is being performed in accordance to policy?",
 "Avoidance":"Risk ____________________ requires that activities with high levels of risk are stopped.",
 "Threat modeling":"What activity is focused on deconstructing a system to better understand the threats and exploits that might impact it?",
}
