{
  "active decoy": "A system designed to distract potential attackers away from an organization's critical systems and data. It creates a false environment that looks like a real system, complete with fake data, applications, and other elements. The decoy system is closely monitored to detect malicious activity and provide early warning and detailed insight into an attacker's tactics and techniques.",
  "Address SpaceLayout Randomization (ASLR)": "A technique that randomizes where components in a running application are placed in memory to protect against buffer overflows.",
  "Advanced Persistent Threat (APT)": "An attacker's ability to obtain, maintain, and diversify access to network systems using exploits and malware.",
  "Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK)": "A knowledge base maintained by the MITRE Corporation for listing and explaining specific adversary tactics, techniques, and procedures.",
  "application programming interface (API)": "Methods exposed by a script or program that allow other scripts or programs to use it. For example, an API enables software developers to access functions of the TCP/IP network stack under a particular operating system.",
  "application virtualization": "A software delivery model where the code runs on a server and is streamed to a client.",
  "Arachni": "An open-source web application scanner.",
  "ARP poisoning": "A network-based attack where an attacker with access to the target local network segment redirects an IP address to the MAC address of a computer that is not the intended recipient. This can be used to perform a variety of attacks, including DoS, spoofing, and Man-in-the-Middle.",
  "attack surface": "The points at which a network or application receive external connections or inputs/outputs that are potential vectors to be exploited by a threat actor.",
  "beaconing": "A means for a network node to advertise its presence and establish a link with other nodes, such as the beacon management frame sent by an AP. Legitimate software and appliances do this, but it is also associated with Remote Access Trojans (RAT) communicating with a Command & Control server.",
  "broken authentication": "A software vulnerability where the authentication mechanism allows an attacker to gain entry, such as displaying cleartext credentials, using weak session tokens, or permitting brute force login requests.",
  "buffer overflow": "An attack in which data goes past the boundary of the destination buffer and begins to corrupt adjacent memory. This can allow the attacker to crash the system or execute arbitrary code.",
  "Burp Suite": "A proprietary interception proxy and web application assessment tool.",
  "business continuity (BC)": "A collection of processes that enable an organization to maintain normal business operations in the face of some adverse event.",
  "cardholder data (CHD)": "Any type of personally identifiable information (PII) associated with a person who has a payment card, such as a credit or debit card.",
  "Center for Internet Security (CIS)": "A not-for-profit organization (founded partly by SANS). It publishes the well-known Top 20 Critical Security Controls (or system design recommendations).",
  "change management": "The process through which changes to the configuration of information systems are implemented as part of the organization's overall configuration management efforts.",
  "closure meetings": "Sessions held at the end of a project or phase in which you discuss and document areas for improvement and capture lessons learned for use in future projects.",
  "cloud access security broker (CASB)": "Enterprise management software designed to mediate access to cloud services by users across all types of devices.",
  "cloud deployment model": "Classifying the ownership and management of a cloud as public, private, community, or hybrid.",
  "command and control (C2 or C&C)": "Infrastructure of hosts and services with which attackers direct, distribute, and control malware over botnets.",
  "common configuration enumeration (CCE)": "A scheme for provisioning secure configuration checks across multiple sources developed by MITRE and adopted by NIST.",
  "common platform enumeration (CPE)": "A scheme for identifying hardware devices, operating systems, and applications developed by MITRE.",
  "common protocol over non-standard port": "Communicating TCP/IP application traffic, such as HTTP, FTP, or DNS, over a port that is not the well-known or registered port established for that protocol.",
  "common vulnerabilities and exposures (CVE)": "A scheme for identifying vulnerabilities developed by MITRE and adopted by NIST.",
  "Common Vulnerability Scoring System (CVSS)": "A risk management approach to quantifying vulnerability data and then taking into account the degree of risk to different types of systems or information.",
  "compensating control": "A security measure that takes on risk mitigation when a primary control fails or cannot completely meet expectations.",
  "configuration baseline": "Settings for services and policy configuration for a network appliance or for a server operating in a particular application role (web server, mail server, file/print server, and so on).",
  "container": "An operating system virtualization deployment containing everything required to run a service, application, or microservice.",
  "cookie": "A text file used to store information about a user when they visit a website. Some sites use cookies to support user sessions.",
  "corrective control": "A type of security control that acts after an incident to eliminate or minimize its impact.",
  "credential stuffing": "A brute force attack in which stolen user account names and passwords are tested against multiple websites.",
  "criminal syndicates": "A type of threat actor that uses hacking and computer fraud for commercial gain.",
  "cross-site request forgery (XSRF)": "A malicious script hosted on the attacker's site that can exploit a session started on another site in the same browser.",
  "cross-site scripting (XSS)": "A malicious script hosted on the attacker's site or coded in a link injected onto a trusted site, designed to compromise clients browsing the trusted site, circumventing the browser's security model of trusted zones.",
  "crowdsource": "A process in which a large group of individuals, usually from the public, are asked to contribute to a project or task. It often involves the collection of ideas, information, opinions, or feedback from a wide range of people, typically through an online platform.",
  "cyber threat intelligence (CTI)": "The process of investigating, collecting, analyzing, and disseminating information about emerging threats and threat sources.",
  "dark web": "Resources on the Internet that are distributed between anonymized nodes and protected from general access by multiple layers of encryption and routing.",
  "data exfiltration": "The process by which an attacker takes data that is stored inside of a private network and moves it to an external network.",
  "data historian": "Software that aggregates and catalogs data from multiple sources within an industrial control system.",
  "data loss (leak) prevention (DLP)": "A software solution that detects and prevents sensitive information from being stored on unauthorized systems or transmitted over unauthorized networks.",
  "detective control": "A type of security control that acts during an incident to identify or record that it is happening.",
  "directory traversal": "An application attack that allows access to commands, files, and directories that may or may not be connected to the web document root directory.",
  "disaster recovery plan (DRP)": "A documented and resourced plan showing actions and responsibilities to be used in response to critical incidents.",
  "distributed denial of service attack (DDoS attack)": "An attack that uses multiple compromised hosts (a botnet) to overwhelm a service with requests or response traffic.",
  "distributed denial-of-service (DDoS)": "An attack that involves the use of infected Internet-connected computers and devices to disrupt the normal flow of traffic of a server or service by overwhelming the target with traffic.",
  "Domain-based Message Authentication, Reporting, and Conformance (DMARC)": "A framework for ensuring proper application of SPF and DKIM, utilizing a policy published as a DNS record.",
  "DomainKeys Identified Mail (DKIM)": "A cryptographic authentication mechanism for mail, utilizing a public key published as a DNS record.",
  "dynamic analysis": "Software testing that examines code behavior during runtime. It helps identify potential security issues, potential performance issues, and other problems.",
  "endpoint detection and response (EDR)": "A software agent that collects system data and logs for analysis by a monitoring system to provide early detection of threats.",
  "executive summary": "A part of the written report that is a high-level and concise overview of the penetration test, its findings, and their impact.",
  "exploit": "A specific method by which malware code infects a target host, often via some vulnerability in a software process.",
  "eXtensible Markup Language (XML)": "A system for structuring documents so that they are human and machine readable. Information within the document is placed within tags, which describe how information within the document is structured.",
  "federation": "A process that provides a shared login capability across multiple systems and enterprises. It essentially connects the identity management services of multiple systems.",
  "file inclusion": "A web application vulnerability that allows an attacker either to download a file from an arbitrary location on the host file system or to upload an executable or script file to open a backdoor.",
  "fingerprinting": "Identifying the type and version of an operating system (or server application) by analyzing its responses to network scans.",
  "footprint": "An attack that aims to list resources on the network, host, or system as a whole to identify potential targets for further attack.",
  "forensics": "The process of gathering and submitting computer evidence for trial. Digital evidence is latent, meaning that it must be interpreted. This means that great care must be taken to prove that the evidence has not been tampered with or falsified.",
  "fuzzing": "A dynamic code analysis technique that involves sending a running application random and unusual input so as to evaluate how the app responds.",
  "hacktivist": "A threat actor that is motivated by a social issue or political cause.",
  "hardening": "A process of making a host or app configuration secure by reducing its attack surface through running only necessary services, installing monitoring software to protect against malware and intrusions, and establishing a maintenance schedule to ensure the system is patched to be secure against software exploits.",
  "hash": "The theoretically indecipherable fixed-length output of the hashing process.",
  "heap overflow": "A software vulnerability where input is allowed to overwrite memory locations within the area of a process's memory allocation used to store dynamically sized variables.",
  "high-interaction honeypot": "A design to mimic real production systems, making it difficult for attackers to tell the difference between the honeypot and a real system. This aims to capture more detailed attack information than can be accomplished by using a low-interaction honeypot, allowing security teams to understand an attacker better.",
  "honeypot": "A host, network, or file set up with the purpose of luring attackers away from assets of actual value and/or discovering attack strategies and weaknesses in the security configuration.",
  "human-machine interface (HMI)": "Input and output controls on a PLC to allow a user to configure and monitor the system.",
  "hybrid cloud": "Cloud deployment that uses both private and public elements.",
  "impossible travel": "A tracking of information such as GPS address, IP address, or user's device to pinpoint a user's location and determine whether a behavior was physically possible.",
  "in-band authentication": "Use of a communication channel that is the same as the one currently being used.",
  "incident response plan (IRP)": "Specific procedures that must be performed if a certain type of event is detected or reported.",
  "indicator of compromise (IoC)": "A sign that an asset or network has been attacked or is currently under attack.",
  "indicators of attack (IoA)": "Signs or clues indicating a malicious attack on a system or network is currently occurring. These include, but are not limited to, unusual network traffic, strange log file entries, or suspicious user account activity.",
  "industrial control system (ICS)": "Network managing embedded devices (computer systems that are designed to perform a specific, dedicated function).",
  "Information Sharing and Analysis Center (ISAC)": "A not-for-profit group set up to share sector-specific threat intelligence and security best practices among its members.",
  "input validation": "Any technique used to ensure that the data entered into a field or variable in an application is handled appropriately by that application.",
  "insecure object reference": "A coding vulnerability where unvalidated input is used to select a resource object, such as a file or database.",
  "integer overflow": "An attack in which a computed result is too large to fit in its assigned storage space, which may lead to crashing or data corruption, and may trigger a buffer overflow.",
  "intellectual property (IP)": "Data that is of commercial value and can be granted rights of ownership, such as copyrights, patents, and trademarks.",
  "International Organization for Standardization (ISO)": "Develops many standards and frameworks governing the use of computers, networks, and telecommunications, including ones for information security (27K series) and risk management (31K series).",
  "internet relay chat (IRC)": "A group communications protocol that enables users to chat, send private messages, and share files.",
  "intrusion detection system (IDS)": "A security appliance or software that analyzes data from a packet sniffer to identify traffic that violates policies or rules.",
  "JavaScript Object Notation (JSON)": "A file format that uses attribute-value pairs to define configurations in a structure that is easy for both humans and machines to read and consume.",
  "kill chain": "A model developed by Lockheed Martin that describes the stages by which a threat actor progresses to a network intrusion.",
  "lateral movement": "The process by which an attacker is able to move from one part of a computing environment to another.",
  "lessons learned report (LLR)": "An analysis of events that can provide insight into how to improve response and support processes in the future.",
  "managed security service provider (MSSP)": "A third-party provision of security configuration and monitoring as an outsourced service.",
  "managerial control": "A category of security control that gives oversight of the information system.",
  "memorandum of understanding (MoU)": "Usually a preliminary or exploratory agreement to express an intent to work together that is not legally binding and does not involve the exchange of money.",
  "Metasploit Framework (MSF)": "A platform for launching modularized attacks against known software vulnerabilities.",
  "microservice": "An independent, single-function module with well-defined and lightweight interfaces and operations. Typically, this style of architecture allows for rapid, frequent, and reliable delivery of complex applications.",
  "mismatched port/application traffic": "Communicating non-standard traffic over a well-known or registered port.",
  "Nessus": "One of the best-known commercial vulnerability scanners, produced by Tenable Network Security.",
  "Network Separation": "Enforcing a security zone by separating a segment of the network from access by the rest of the network. This could be accomplished using firewalls or VPNs or VLANs. A physically separate network or host (with no cabling or wireless links to other networks) is referred to as air-gapped.",
  "Nikto": "A vulnerability scanner that can be used to identify known web server vulnerabilities and misconfigurations, identify web applications running on a server, and identify potential known vulnerabilities in those web applications.",
  "Nmap": "An IP and port scanner used for topology, host, service, and OS discovery and enumeration.",
  "on-premises": "Software or services installed and managed on a customer’s computing infrastructure rather than in the cloud or hosted by a third-party provider.",
  "Open Source Security Testing Methodology Manual (OSSTMM)": "Developed by the Institute for Security and Open Methodologies (ISECOM), this manual outlines every area of an organization that needs testing and goes into details about how to conduct the relevant tests.",
  "Open Vulnerability and Assessment Language (OVAL)": "An XML schema, maintained by MITRE, for describing system security state and querying vulnerability reports and information.",
  "Open Web Application Security Project (OWASP)": "A charity and community publishing a number of secure application development resources.",
  "openID": "An identity federation method that enables users to be authenticated on cooperating websites by a third-party authentication service.",
  "open-source intelligence (OSINT)": "Publicly available information plus the tools used to aggregate and search it.",
  "OpenVAS (Vulnerability Assessment System)": "An open-source vulnerability scanner, originally developed from the Nessus codebase at the point where Nessus became commercial software.",
  "operational control": "A category of security control that is implemented by people.",
  "operational technology (OT)": "A communications network designed to implement an industrial control system rather than data networking.",
  "out-of-band mechanism": "Use of a communication channel that is different than the one currently being used.",
  "output encoding": "Coding methods to sanitize output created from user input.",
  "Pacu": "An open-source cloud penetration testing framework.",
  "passwordless authentication": "A form of authentication that does not require the use of knowledge-based information, such as a password, in order to prove identity.",
  "Payment Card Industry Data Security Standard (PCI DSS)": "An information security standard for organizations that process credit or bank card payments.",
  "persistence": "In cybersecurity, the ability of a threat actor to maintain covert access to a target host or network.",
  "personal identifiable financial information (PIFI)": "Personal information about a consumer provided to a financial institution that can include account number, credit/debit card number, name, social security number, and other information.",
  "personally identifiable information (PII)": "Data that can be used to identify or contact an individual (or, in the case of identity theft, to impersonate them).",
  "playbook": "A checklist of actions to perform to detect and respond to a specific type of incident.",
  "plugins": "Additions that help tailor the software product to more closely match the infrastructure being managed from one organization to another.",
  "PowerShell (PS)": "A command shell and scripting language built on the .NET Framework that uses cmdlets for Windows automation.",
  "preventative control": "A type of security control that acts before an incident to eliminate or reduce the likelihood that an attack can succeed.",
  "private cloud": "Cloud that is deployed for use by a single entity.",
  "privilege escalation": "The practice of exploiting flaws in an operating system or other application to gain a greater level of access than was intended for the user or application.",
  "privileged user account": "A user account with elevated access to a system and that is granted additional permissions that other user accounts do not have. These additional permissions allow privileged users to perform administrative tasks and access sensitive data.",
  "programmable logic controller (PLC)": "A type of processor designed for deployment in an industrial or outdoor setting that can automate and monitor mechanical systems.",
  "protected health information (PHI)": "Data that can be used to identify an individual and includes information about past, present, or future health as well as related payments and data used in the operation of a healthcare business.",
  "Prowler": "An open-source cloud vulnerability scanner designed for AWS auditing.",
  "proxy server": "A server that mediates the communications between a client and another server. It can filter and often modify communications as well as provide caching services to improve performance.",
  "public cloud": "Cloud that is deployed for shared use by multiple independent tenants.",
  "public key infrastructure (PKI)": "A framework of certificate authorities, digital certificates, software, services, and other cryptographic components deployed for the purpose of validating subject identities.",
  "Python": "A high-level programming language that is widely used for automation.",
  "Qualys": "A cloud-based vulnerability management solution. Users install sensor agents at various points in their network, and the sensors upload data to the cloud platform for analysis.",
  "reconnaissance": "The actions taken to gather information about an individual's or organization's computer systems and software. This typically involves collecting information such as the types of systems and software used, user account information, data types, and network configuration.",
  "regular expression (regex)": "A group of characters that describe how to execute a specific search pattern on a given text.",
  "responsive control": "A type of security control that serves to direct corrective actions after an incident has been confirmed.",
  "reverse engineering": "The process of analyzing the structure of hardware or software to reveal more about how it functions.",
  "reverse proxy": "A type of proxy server that protects servers from direct contact with client requests.",
  "rogue device": "An unauthorized device or service, such as a wireless access point DHCP server, or DNS server, on a corporate or private network that allows unauthorized individuals to connect to the network.",
  "root cause analysis": "A technique used to determine the true cause of the problem that, when removed, prevents the problem from occurring again.",
  "sandbox": "A computing environment that is isolated from a host system to guarantee that the environment runs in a controlled, secure fashion. Communication links between the sandbox and the host are usually completely prohibited so that malware or faulty software can be analyzed in isolation and without risk to the host.",
  "ScoutSuite": "An open-source cloud vulnerability scanner designed for AWS, Azure, and GCP auditing.",
  "Secure AccessService Edge (SASE)": "A networking and security architecture that provides secure access to cloud applications and services while reducing complexity. It combines security services like firewalls, identity and access management, and a secure web gateway with networking services such as SD-WAN.",
  "Secure Sockets Layer (SSL)": "The original, obsolete version of the security protocol now developed as TLS.",
  "security assertion markup language (SAML)": "An XML-based data format used to exchange authentication information between a client and a service.",
  "Security Content Automation Protocol (SCAP)": "A NIST framework that outlines various accepted practices for automating vulnerability scanning.",
  "security information and event management (SIEM)": "A solution that provides real-time or near-real-time analysis of security alerts generated by network hardware and applications.",
  "security operations center (SOC)": "The location where security professionals monitor and protect critical information assets in an organization.",
  "security orchestration, automation, and response (SOAR)": "A class of security tools that facilitates incident response, threat hunting, and security configuration by orchestrating automated runbooks and delivering data enrichment.",
  "security system development lifecycle (SSDLC)": "A method of system development that incorporates security controls in every phase of the system's lifecycle.",
  "Sender Policy Framework (SPF)": "A DNS record identifying hosts authorized to send mail for the domain.",
  "serverless computing": "Features and capabilities of a server without needing to perform server administration tasks. Serverless computing offloads infrastructure management to the cloud service provider—for example, configuring file storage capability without the requirement of first building and deploying a file server.",
  "server-side request forgery (SSRF)": "An attack where an attacker takes advantage of the trust established between the server and the resources it can access, including itself.",
  "service level agreement (SLA)": "Operating procedures and standards for a service contract.",
  "Simple Object Access Protocol (SOAP)": "An XML-based web services protocol that is used to exchange messages.",
  "single pane of glass": "A comprehensive, unified user interface that provides a comprehensive view of an IT environment and allows administrators to manage all connected components from one place. This type of interface simplifies the management of complex IT infrastructures.",
  "single sign-on (SSO)": "Authentication technology that enables a user to authenticate once and receive authorizations for multiple services.",
  "software as a service (SaaS)": "A cloud service model that provisions fully developed application services to users.",
  "software-defined networking (SDN)": "APIs and compatible hardware/virtual appliances allowing for programmable network appliances and systems.",
  "software repository": "A centralized storage location for software packages.",
  "standalone server": "A server that is not integrated into a Microsoft Active Directory domain.",
  "state actor": "A type of threat actor that is supported by the resources of its host country's military and security services.",
  "static code analysis": "The process of reviewing uncompiled source code either manually or using automated tools.",
  "Structured Query Language injection (SQL injection)": "An attack that injects a database query into the input data directed at a server by accessing the client side of the application.",
  "supervisory control and data acquisition (SCADA)": "A type of industrial control system that manages large-scale, multiple-site devices and equipment spread over geographically large areas from a host computer.",
  "tabletop exercise": "A discussion of simulated emergency situations and security incidents.",
  "tactics, techniques, and procedures (TTP)": "Analysis of historical cyberattacks and adversary actions.",
  "tcpdump command": "A command-line packet sniffing utility.",
  "technical control": "A category of security control that is implemented as a system (hardware, software, or firmware). Technical controls may also be described as logical controls.",
  "threat actor": "A person or entity responsible for an event that has been identified as a security incident or as a risk.",
  "threat hunting": "A cybersecurity technique designed to detect the presence of threats that have not been discovered by normal security monitoring.",
  "threat modeling": "The process of identifying and assessing the possible threat actors and attack vectors that pose a risk to the security of an app, network, or other system.",
  "timeline": "In digital forensics, a tool that shows the sequence of file system events within a source image in a graphical format.",
  "traffic spike": "A sharp increase in connection requests in comparison with a baseline.",
  "Trojan": "A malicious software program hidden within an innocuous-seeming piece of software. Usually, the Trojan is used to try to compromise the security of the target computer.",
  "trust model": "In PKI, a description of how users and different CAs exchange information and certificates.",
  "user and entity behavior analytics (UEBA)": "A system that can provide automated identification of suspicious activity by user accounts and computer hosts.",
  "virtual private cloud (VPC)": "A private network segment made available to a single cloud consumer on a public cloud.",
  "virtualization": "A computing environment where multiple independent operating systems can be installed to a single hardware platform and run simultaneously.",
  "virus": "Malicious code inserted into an executable file image. The malicious code is executed when the file is run and can deliver a payload, such as attempting to infect other files.",
  "vulnerability scanner": "Hardware or software configured with a list of known weaknesses and exploits and that can scan for their presence in a host OS or particular application.",
  "webhooks": "Automated messages sent from applications to other applications containing information about an event, such as the time it occurred, the data associated with it, and any other relevant information.",
  "Windows Management Instrumentation Command-Line (WMIC)": "A tool that provides an interface into Windows Management Instrumentation (WMI) for local or remote management of computers.",
  "Wireshark": "A widely used protocol analyzer.",
  "Zed Attack Proxy (ZAP)": "An open-source interception proxy and web application assessment tool."
}
