{
"exam code": "CS0-003",
"certification": "CSA+",
"lesson": 1,
"lesson_name": "Understanfing Vulnerability Reponse, Handling, and Management",
"topic": "1C",
"topic_name": "Explaing Patch Management Concepts",

"Patch management ":"Regularly monitoring, assessing, and updating an organization's software, such as operating systems, applications, and device drivers.",
"Patch management consideration":"An individual or task-specific team responsible for reviewing vendor-supplied newsletters and security patch bulletins.",
"Patch management consideration":"Mechanisms to patch operating systems and all applications running on it, regardless of application vendor.",
"Patch management consideration":"Patch management principles that incorporate cloud resources.",
"Patch management consideration":"Assigning updates into urgent, important, and noncritical categories.",
"Patch management consideration":"A patch test environment where urgent and important patches can be installed and tested and analyzed prior to deployment into production.",
"Patch management consideration":"Detailed logging designed to support monitoring and troubleshooting of patch deployment activities.",
"Patch management consideration":"A method to evaluate firmware updates prior to deployment.",
"Patch management consideration":"Immediate push delivery of critical security patches.",
"Patch management consideration":"A routine schedule for the rollout of noncritical patches.",
"Patch testing":"Determine whether a software patch creates problems with the organization's unique mix of hardware, software, and configuration settings.",
"Centralized configuration management system":"Where administrators define device configuration settings on a management server and then push the settings to endpoints in an automated way.",
"Configuration management":"Tool allows administrators to centrally create and enforce software settings?.",
"Change management":"Which policy dictates how work is completed during a maintenance window?.",
}
