{
"exam code": "CS0-003",
"certification": "CSA+",
"lesson": 1,
"lesson_name": "Understanfing Vulnerability Reponse, Handling, and Management",
"topic" : "1B",
"topic_name": "Exploring Control types and methods",

"Security controls":"Can help protect an organization's valuable assets and data from unauthorized access, theft, by implementing technical measures, such as firewalls ,encryption and employee training and awareness.",
"Technical":"The control is implemented as a system (hardware, software, or firmware).",
"Operational":"The control is implemented primarily by people rather than systems.",
"Managerial":"The control gives oversight of the information system.",
"Passive discovery ":" Describes the methods used to identify systems, services, and protocols indirecty.It leverages careful observation to show characteristics of network-connected software and devices.",
"Edge discovery": "Internt facing servers or every device with internet connnectivity.",
"Asset inventory":"Conducting an inventory of all hardware, software assets, and user accounts in the environment to determine which assets are essential for business operations and which can be removed.",
"Access control":"Strict access control measures, such as multifactor authentication. Limiting access to sensitive data and systems reduces the risk of unauthorized access.",
"Patching and updating":"Regularly patching and updating software and firmware can prevent attackers from exploiting known vulnerabilities.",
"Network segmentation":"Reducing the attack surface by segmenting a large network into smaller subnets that can limit the damage an attacker can cause.",
"Removing unnecessary components":"Removing hardware or software components reduces the attack surface. By removing software, the organization eliminates a pathway that attackers can exploit.",
"Employee training":"Reduce the attack surface by raising awareness of the potential risks and the importance of security measures.",
"Managerial":"The leadership teams would like to develop controls designed to provide oversight of various information systems.",
"Technical":"A web application firewall identifies and records any attempted or successful intrusion to a log file.",
"Responsive":"After identifying that a port scan was performed on an internal database system, a security analyst performs a series of well-defined steps to further investigate the issue.",
"Attack surface":"What is being analyzed when all potential pathways a threat actor could use to gain unauthorized access or control of a system are identified and documented?",
"Passive discovery":"Systems, services, and protocols are discovered and characterized by analyzing network packet aptures,
}
